cmsis-svd/cmsis-svd/data/SiliconLabs/EFR32BG13P632F512GM48.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CMU</name>
      <version>5.7.0</version>
      <description>CMU</description>
      <baseAddress>0x400E4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CMU</name>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>CMU Control Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00300000</resetValue>
          <resetMask>0x001103FF</resetMask>
          <fields>
            <field>
              <name>CLKOUTSEL0</name>
              <description>Clock Output Select 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO (directly from oscillator)</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO (directly from oscillator)</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO (directly from oscillator)</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO (directly from oscillator)</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFEXPCLK</name>
                  <description>HFEXPCLK</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCOQ</name>
                  <description>ULFRCO (qualified)</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCOQ</name>
                  <description>LFRCO (qualified)</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXOQ</name>
                  <description>LFXO (qualified)</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOQ</name>
                  <description>HFRCO (qualified)</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXHFRCOQ</name>
                  <description>AUXHFRCO (qualified)</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXOQ</name>
                  <description>HFXO (qualified)</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFSRCCLK</name>
                  <description>HFSRCCLK</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUTSEL1</name>
              <description>Clock Output Select 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO (directly from oscillator)</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO (directly from oscillator)</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO (directly from oscillator)</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO (directly from oscillator)</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFEXPCLK</name>
                  <description>HFEXPCLK</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCOQ</name>
                  <description>ULFRCO (qualified)</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCOQ</name>
                  <description>LFRCO (qualified)</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXOQ</name>
                  <description>LFXO (qualified)</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOQ</name>
                  <description>HFRCO (qualified)</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXHFRCOQ</name>
                  <description>AUXHFRCO (qualified)</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXOQ</name>
                  <description>HFXO (qualified)</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFSRCCLK</name>
                  <description>HFSRCCLK</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSHFLE</name>
              <description>Wait State for High-Frequency LE Interface</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HFPERCLKEN</name>
              <description>HFPERCLK Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFRCOCTRL</name>
          <description>HFRCO Control Register</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xB1481F7F</resetValue>
          <resetMask>0xFFFF3F7F</resetMask>
          <fields>
            <field>
              <name>TUNING</name>
              <description>HFRCO Tuning Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FINETUNING</name>
              <description>HFRCO Fine Tuning Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQRANGE</name>
              <description>HFRCO Frequency Range</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPBIAS</name>
              <description>HFRCO Comparator Bias Current</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDOHP</name>
              <description>HFRCO LDO High Power Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Locally Divide HFRCO Clock Output</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Divide by 1.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide by 2.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide by 4.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FINETUNINGEN</name>
              <description>Enable Reference for Fine Tuning</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VREFTC</name>
              <description>HFRCO Temperature Coefficient Trim on Comparator Reference</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXHFRCOCTRL</name>
          <description>AUXHFRCO Control Register</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xB1481F7F</resetValue>
          <resetMask>0xFFFF3F7F</resetMask>
          <fields>
            <field>
              <name>TUNING</name>
              <description>AUXHFRCO Tuning Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FINETUNING</name>
              <description>AUXHFRCO Fine Tuning Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQRANGE</name>
              <description>AUXHFRCO Frequency Range</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPBIAS</name>
              <description>AUXHFRCO Comparator Bias Current</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDOHP</name>
              <description>AUXHFRCO LDO High Power Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Locally Divide AUXHFRCO Clock Output</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Divide by 1.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide by 2.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide by 4.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FINETUNINGEN</name>
              <description>Enable Reference for Fine Tuning</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VREFTC</name>
              <description>AUXHFRCO Temperature Coefficient Trim on Comparator Reference</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LFRCOCTRL</name>
          <description>LFRCO Control Register</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x81060100</resetValue>
          <resetMask>0xF33701FF</resetMask>
          <fields>
            <field>
              <name>TUNING</name>
              <description>LFRCO Tuning Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENVREF</name>
              <description>Enable Duty Cycling of Vref</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENCHOP</name>
              <description>Enable Comparator Chopping</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDEM</name>
              <description>Enable Dynamic Element Matching</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VREFUPDATE</name>
              <description>Control Vref Update Rate</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32CYCLES</name>
                  <description>32 clocks.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64CYCLES</name>
                  <description>64 clocks.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128CYCLES</name>
                  <description>128 clocks.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CYCLES</name>
                  <description>256 clocks.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>LFRCO Timeout</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2CYCLES</name>
                  <description>Timeout period of 2 cycles</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CYCLES</name>
                  <description>Timeout period of 16 cycles</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CYCLES</name>
                  <description>Timeout period of 32 cycles</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GMCCURTUNE</name>
              <description>Tuning of Gmc Current</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
